BstarTest/ns/BstarTest/webServiceConnectors/consumers/procurementManager/wsdl0

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.11-b150616.1732 svn-revision#a247ba216861f2c0baac9a3657c5690bce0c744d. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.11-b150616.1732 svn-revision#a247ba216861f2c0baac9a3657c5690bce0c744d. --><definitions xmlns:wssutil="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://oracle.e1.bssv.JP430000/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://oracle.e1.bssv.JP430000/" name="ProcurementManagerService">
<wsp:UsingPolicy wssutil:Required="true"/>
<wsp1_2:Policy wssutil:Id="bssvpolicy">
<ns1:TransportBinding xmlns:ns1="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
<wsp1_2:Policy>
<ns1:TransportToken>
<wsp1_2:Policy>
<ns1:HttpsToken/>
</wsp1_2:Policy>
</ns1:TransportToken>
<ns1:AlgorithmSuite>
<wsp1_2:Policy>
<ns1:Basic256/>
</wsp1_2:Policy>
</ns1:AlgorithmSuite>
<ns1:Layout>
<wsp1_2:Policy>
<ns1:Lax/>
</wsp1_2:Policy>
</ns1:Layout>
</wsp1_2:Policy>
</ns1:TransportBinding>
<ns2:SupportingTokens xmlns:ns2="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
<wsp1_2:Policy>
<ns2:UsernameToken ns2:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702/IncludeToken/AlwaysToRecipient">
<wsp1_2:Policy>
<ns2:WssUsernameToken10/>
</wsp1_2:Policy>
</ns2:UsernameToken>
</wsp1_2:Policy>
</ns2:SupportingTokens>
</wsp1_2:Policy>
<types>
<xsd:schema>
<xsd:import namespace="http://oracle.e1.bssv.JP430000/" schemaLocation="BstarTest.webServiceConnectors.consumers.procurementManager?xsd=xsd0"/>
</xsd:schema>
</types>
<message name="getPurchaseOrder">
<part name="getPurchaseOrder" element="tns:getPurchaseOrder"/>
</message>
<message name="getPurchaseOrderResponse">
<part name="getPurchaseOrderResponse" element="tns:getPurchaseOrderResponse"/>
</message>
<message name="BusinessServiceException">
<part name="fault" element="tns:BusinessServiceException"/>
</message>
<message name="processPurchaseOrderAcknowledge">
<part name="processPurchaseOrderAcknowledge" element="tns:processPurchaseOrderAcknowledge"/>
</message>
<message name="processPurchaseOrderAcknowledgeResponse">
<part name="processPurchaseOrderAcknowledgeResponse" element="tns:processPurchaseOrderAcknowledgeResponse"/>
</message>
<message name="getPurchaseOrderV2">
<part name="getPurchaseOrderV2" element="tns:getPurchaseOrderV2"/>
</message>
<message name="getPurchaseOrderV2Response">
<part name="getPurchaseOrderV2Response" element="tns:getPurchaseOrderV2Response"/>
</message>
<message name="processPurchaseOrder">
<part name="processPurchaseOrder" element="tns:processPurchaseOrder"/>
</message>
<message name="processPurchaseOrderResponse">
<part name="processPurchaseOrderResponse" element="tns:processPurchaseOrderResponse"/>
</message>
<message name="processPurchaseOrderV2">
<part name="processPurchaseOrderV2" element="tns:processPurchaseOrderV2"/>
</message>
<message name="processPurchaseOrderV2Response">
<part name="processPurchaseOrderV2Response" element="tns:processPurchaseOrderV2Response"/>
</message>
<message name="getPurchaseOrdersForApprover">
<part name="getPurchaseOrdersForApprover" element="tns:getPurchaseOrdersForApprover"/>
</message>
<message name="getPurchaseOrdersForApproverResponse">
<part name="getPurchaseOrdersForApproverResponse" element="tns:getPurchaseOrdersForApproverResponse"/>
</message>
<message name="getPurchaseOrderDetailForApprover">
<part name="getPurchaseOrderDetailForApprover" element="tns:getPurchaseOrderDetailForApprover"/>
</message>
<message name="getPurchaseOrderDetailForApproverResponse">
<part name="getPurchaseOrderDetailForApproverResponse" element="tns:getPurchaseOrderDetailForApproverResponse"/>
</message>
<message name="getPurchaseOrderEmployeeProfile">
<part name="getPurchaseOrderEmployeeProfile" element="tns:getPurchaseOrderEmployeeProfile"/>
</message>
<message name="getPurchaseOrderEmployeeProfileResponse">
<part name="getPurchaseOrderEmployeeProfileResponse" element="tns:getPurchaseOrderEmployeeProfileResponse"/>
</message>
<message name="getPurchaseOrdersCounts">
<part name="getPurchaseOrdersCounts" element="tns:getPurchaseOrdersCounts"/>
</message>
<message name="getPurchaseOrdersCountsResponse">
<part name="getPurchaseOrdersCountsResponse" element="tns:getPurchaseOrdersCountsResponse"/>
</message>
<message name="processPurchaseOrderApproveReject">
<part name="processPurchaseOrderApproveReject" element="tns:processPurchaseOrderApproveReject"/>
</message>
<message name="processPurchaseOrderApproveRejectResponse">
<part name="processPurchaseOrderApproveRejectResponse" element="tns:processPurchaseOrderApproveRejectResponse"/>
</message>
<portType name="ProcurementManager">
<operation name="getPurchaseOrder">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderRequest" message="tns:getPurchaseOrder"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderResponse" message="tns:getPurchaseOrderResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrder/Fault/BusinessServiceException"/>
</operation>
<operation name="processPurchaseOrderAcknowledge">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderAcknowledgeRequest" message="tns:processPurchaseOrderAcknowledge"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderAcknowledgeResponse" message="tns:processPurchaseOrderAcknowledgeResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderAcknowledge/Fault/BusinessServiceException"/>
</operation>
<operation name="getPurchaseOrderV2">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderV2Request" message="tns:getPurchaseOrderV2"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderV2Response" message="tns:getPurchaseOrderV2Response"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderV2/Fault/BusinessServiceException"/>
</operation>
<operation name="processPurchaseOrder">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderRequest" message="tns:processPurchaseOrder"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderResponse" message="tns:processPurchaseOrderResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrder/Fault/BusinessServiceException"/>
</operation>
<operation name="processPurchaseOrderV2">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderV2Request" message="tns:processPurchaseOrderV2"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderV2Response" message="tns:processPurchaseOrderV2Response"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderV2/Fault/BusinessServiceException"/>
</operation>
<operation name="getPurchaseOrdersForApprover">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrdersForApproverRequest" message="tns:getPurchaseOrdersForApprover"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrdersForApproverResponse" message="tns:getPurchaseOrdersForApproverResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrdersForApprover/Fault/BusinessServiceException"/>
</operation>
<operation name="getPurchaseOrderDetailForApprover">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderDetailForApproverRequest" message="tns:getPurchaseOrderDetailForApprover"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderDetailForApproverResponse" message="tns:getPurchaseOrderDetailForApproverResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderDetailForApprover/Fault/BusinessServiceException"/>
</operation>
<operation name="getPurchaseOrderEmployeeProfile">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderEmployeeProfileRequest" message="tns:getPurchaseOrderEmployeeProfile"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderEmployeeProfileResponse" message="tns:getPurchaseOrderEmployeeProfileResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrderEmployeeProfile/Fault/BusinessServiceException"/>
</operation>
<operation name="getPurchaseOrdersCounts">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrdersCountsRequest" message="tns:getPurchaseOrdersCounts"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrdersCountsResponse" message="tns:getPurchaseOrdersCountsResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/getPurchaseOrdersCounts/Fault/BusinessServiceException"/>
</operation>
<operation name="processPurchaseOrderApproveReject">
<input wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderApproveRejectRequest" message="tns:processPurchaseOrderApproveReject"/>
<output wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderApproveRejectResponse" message="tns:processPurchaseOrderApproveRejectResponse"/>
<fault message="tns:BusinessServiceException" name="BusinessServiceException" wsam:Action="http://oracle.e1.bssv.JP430000/ProcurementManager/processPurchaseOrderApproveReject/Fault/BusinessServiceException"/>
</operation>
</portType>
<binding name="ProcurementManagerPortBinding" type="tns:ProcurementManager">
<wsp:PolicyReference URI="#bssvpolicy"/>
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="getPurchaseOrder">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="processPurchaseOrderAcknowledge">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="getPurchaseOrderV2">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="processPurchaseOrder">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="processPurchaseOrderV2">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="getPurchaseOrdersForApprover">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="getPurchaseOrderDetailForApprover">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="getPurchaseOrderEmployeeProfile">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="getPurchaseOrdersCounts">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
<operation name="processPurchaseOrderApproveReject">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="BusinessServiceException">
<soap:fault name="BusinessServiceException" use="literal"/>
</fault>
</operation>
</binding>
<service name="ProcurementManagerService">
<port name="ProcurementManagerPort" binding="tns:ProcurementManagerPortBinding">
<soap:address location="https://10.134.0.7:8081/DV920/ProcurementManager"/>
</port>
</service>
</definitions>